'''   10. Создайте аппликацию,  отображающую окно  диалога  с  кнопкой
"След"  и  холстом,  на котором (словно по снегу) должен постепенно
проявляться след кого-либо, идущего снизу вверх.
   Например, след  ноги  человека

   .oooO
   (   )
    \ (  Oooo.
     \_) (   )
   .oooO  ) /
   (   ) (_/
    \ (  Oooo.
     \_) (   )
   .oooO  ) /
   (   ) (_/
    \ (
     \_)
Гольдфельд Яков
ИСиТ 3 курс'''
# ----------------------------------------------
from time import sleep
from Lib_GUI import *
from tkinter.messagebox import *
# ---------------------------------------------------------
# Код для создания окна с двумя кнопками,
# полем ввода и холстом
# ----------------------------------------------
app=Win("След",245,305,300,250)
app.config(bg="yellow")
f=("Arial", 14)
b1=Button_(app,"След",'black','snow',20,2,0,2,0,10)
b1.b["bg"]="orange"
b2=Button_(app,"Очистить",'black','snow',9,2,1,2,0,10)
b2.b["bg"]="orange"
c=Canvas(app,width=220,height=220,bg='lightyellow')
c.grid(column=0,row=3,columnspan=2,rowspan=1,padx=10,pady=10)

# ----------------------------------------------
# Функция вывода следов на холст
# -------------------
c.g=0
c.i=0
def f():
   b1.b['state']='disable'
   b2.b['state']='disable'
   if c.g<=5:
      c.g=c.g+1
      if(c.i%2==0):
         c.create_text(60,300,text=" .ooO\n(     )\n\  (\n  \_)",fill='black',font=f,anchor=W,justify=CENTER,tag="Crl1")
         c.move("Crl1",0, -80)
      else:
         c.create_text(100,250,text=" Ooo.\n(     )\n )   /\n(_/",fill='black',font=f,anchor=W,justify=CENTER,tag="Crl2")
         c.move("Crl2",0, -80)
      c.i=c.i+1
      app.after(1000, f)
   else:
      b2.b['state']='normal'
# -------------------------------------------------
# Функция очистки поля ввода от введённого значения
# -------------------------------------------------
def clear():
   c.delete("Crl1")
   c.delete("Crl2")
   c.g=0
   b1.b['state']='normal' # Состояние виджета 'кнопка':
                          # активна к восприятию

# ----------------------------------------------------
# Запуск действий при активации соответствующих кнопок
# ----------------------------------------------------
b1.commandB(f)
b2.commandB(clear)
app.run()        
